tags/1.1.9/test/soap/TestRequest.xml


<!--
  Copyright 2004 Cordys R&amp;D B.V. 
 
  This file is part of the Cordys Script Connector. 
 
  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at
  
  http://www.apache.org/licenses/LICENSE-2.0
  
  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.

-->
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP:Body>
    <ExecuteScript xmlns="http://schemas.cordys.com/1.0/coe/ScriptConnector">
      <ScriptId>c:\temp\script-conn.js</ScriptId>
		<ScriptInput>
			<dir>c:\temp</dir>
		</ScriptInput>
    </ExecuteScript>
  </SOAP:Body>
</SOAP:Envelope>